#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Инструкция по созданию поддоменов в Beget вручную

Поскольку Beget не предоставляет публичного REST API,
поддомены нужно создавать через панель управления.
"""

def print_safe(text):
    try:
        print(text)
    except UnicodeEncodeError:
        print(text.encode('cp1251', errors='replace').decode('cp1251'))

INSTRUCTION = """
================================================================================
ИНСТРУКЦИЯ ПО СОЗДАНИЮ 10 ПОДДОМЕНОВ В BEGET
================================================================================

ШАГ 1: Авторизация в панели управления
----------------------------------------
1. Откройте https://cp.beget.com/login
2. Логин: ahilesor
3. Пароль: TezCl3fcQ3$]bfsIV_DHRVDJBJO[&;XRKT49-_3*e#:`
4. Нажмите "Войти"

ШАГ 2: Переход в раздел поддоменов
-----------------------------------
1. В левом меню выберите "Домены и поддомены" -> "Поддомены"
2. Или перейдите напрямую: https://cp.beget.com/domains/subdomains

ШАГ 3: Создание поддоменов
---------------------------
Создайте следующие 10 поддоменов для домена luchshie-yaponskie-avto.ru:

  1. japan-auto1.luchshie-yaponskie-avto.ru
  2. japan-auto2.luchshie-yaponskie-avto.ru
  3. japan-auto3.luchshie-yaponskie-avto.ru
  4. japan-auto4.luchshie-yaponskie-avto.ru
  5. japan-auto5.luchshie-yaponskie-avto.ru
  6. japan-auto6.luchshie-yaponskie-avto.ru
  7. japan-auto7.luchshie-yaponskie-avto.ru
  8. japan-auto8.luchshie-yaponskie-avto.ru
  9. japan-auto9.luchshie-yaponskie-avto.ru
 10. japan-auto10.luchshie-yaponskie-avto.ru

Для каждого поддомена:
  1. Нажмите кнопку "Добавить поддомен"
  2. В поле "Домен" выберите luchshie-yaponskie-avto.ru
  3. В поле "Поддомен" введите название (например, japan-auto1)
  4. Нажмите "Создать"

ШАГ 4: Проверка создания
-------------------------
После создания всех поддоменов:
1. Убедитесь, что все 10 поддоменов отображаются в списке
2. Статус каждого поддомена должен быть "Активен"
3. DNS записи должны обновиться в течение 15-60 минут

================================================================================
ПРИМЕЧАНИЯ
================================================================================

1. Поддомены будут использоваться для прокси-серверов
2. Каждый поддомен должен иметь уникальный IP-адрес
3. После создания поддоменов настройте на них прокси-серверы

================================================================================
"""

print_safe(INSTRUCTION)
